CSI API ETABS v1
cDStAustralian_AS4100_2020.GetPreference Method
 Retrieves the value of a steel design preference item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDStAustralian_AS4100_2020
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 17, inclusive, indicating the preference item considered
Multi-response case design
Framing type
Structural analysis method
Steel type
Capacity factor, Phi bending
Capacity factor, Phi compression
Capacity factor, Phi tension yielding
Capacity factor, Phi tension fracture
Capacity factor, Phi shear
Consider deflection
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total camber limit, L/Value
Pattern live load factor
Demand/capacity ratio limit
Value
Type: System.Double
 The value of the considered preference item
Multi-response case design
1 - Envelopes
2 - Step-by-step
3 - Last step
4 - Envelopes -- All
5 - Step-by-step -- All
Framing type
1 - Moment frame
2 - Braced frame
Structural analysis method
1 - General 2nd Order
2 - Amplified 1st Order
Steel type
1 - Hot rolled
2 - Hot finished
3 - Cold form
4 - Stress relieved
5 - Lightly welded
6 - Heavily welded
Capacity factor, Phi bending
Value > 0
Capacity factor, Phi compression
Value > 0
Capacity factor, Phi tension yielding
Value > 0
Capacity factor, Phi tension fracture
Value > 0
Capacity factor, Phi shear
Value > 0
Consider deflection
0 = No
Any other value = Yes
DL deflection limit, L/Value
Value > 0
SDL + LL deflection limit, L/Value
Value > 0
LL deflection limit, L/Value
Value > 0
Total deflection limit, L/Value
Value > 0
Total camber limit, L/Value
Value > 0
Pattern live load factor
Value >= 0
Demand/capacity ratio limit
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise, it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("AS 4100:2020")
'get preference item
   ret = SapModel.DesignSteel.Australian_AS4100_2020.GetPreference(4, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStAustralian_AS4100_2020 Interface
ETABSv1 Namespace